/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_list.h                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ititkov <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/01/18 19:26:11 by ititkov           #+#    #+#             */
/*   Updated: 2019/01/18 19:34:56 by ititkov          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef FT_LIST_H
# define FT_LIST_H

typedef struct			s_list // Имя структуры
{
	struct s_list		*next; // Почему struct внутри и снаружи? На эту тему
	void				*data; // что-то было у Кернигана и Ритчи ...
}						t_list // Имя типа данных объявленного как s_list

int	ft_list_size(t_list *begin_list); // Нужна здесь точка с запятой?

#endif
