/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   print_bits.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ititkov <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/01/18 14:23:20 by ititkov           #+#    #+#             */
/*   Updated: 2019/01/18 15:15:56 by ititkov          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>

void	print_bits(unsigned char octet)
{
	unsigned char		r;
	int					i;
	unsigned char		b;

	r = 128;			// 256
	i = 0;				// Не нужно, если в условии цикла r >>= 1

	while (i < 8) 		// (r >>= 1)
	{
		b = (octet & r); // (Вставить в условие бинарной операции
		(b > 0) ? (write(1, "1", 1)) : (write(1, "0", 1));
		r >>= 1; 		// Не нужено если в условии цикла r >>= 1
		i++;			// Не нужно, если в условии цикла r >>= 1
	}
}

/*int		main(void)
{
	unsigned char		octet;

	octet = 5;
	print_bits(octet);
	return (0);
} */
