/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   sort_list.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: exam <marvin@42.fr>                        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/02/05 11:16:41 by exam              #+#    #+#             */
/*   Updated: 2019/02/05 11:22:35 by exam             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
 * Пока рано, я ещё с remove_if до конца не разобрался
*/

t_list		*sort_list(t_list* lst, int (*cmp)(int, int))
{
	t_list		*one;
	t_list		*two;

	one = lst;
	two = lst->next;
	return (lst-next);
}

